In [1]:
#1.Write a Pandas program to create and display a one-dimensional 
#array-like object containing an array of data using Pandas module.
import pandas as pd
a=pd.Series([10,11,12,13,14,15])
print(a)

0    10
1    11
2    12
3    13
4    14
5    15
dtype: int64

In [5]:
#2.Write a pandas program to convert a pandas module series to python list.
a=pd.Series([10,11,12,13,14,15])
l=pd.Series.to_list(a)
print(l)
type(a)
type(l)

[10, 11, 12, 13, 14, 15]

list

In [9]:
#3.Write a pandas program to add, subtract, multiple and divide two pandas series
a=pd.Series([1,2,3,4,5])
b=pd.Series([11,12,13,14,15])
print("Add :\n",a+b)
print("Sub :\n",a-b)
print("Mul :\n",a*b)
print("div :\n",a/b)

Add :
 0    12
1    14
2    16
3    18
4    20
dtype: int64
Sub :
 0   -10
1   -10
2   -10
3   -10
4   -10
dtype: int64
Mul :
 0    11
1    24
2    39
3    56
4    75
dtype: int64
div :
 0    0.090909
1    0.166667
2    0.230769
3    0.285714
4    0.333333
dtype: float64

In [18]:
#4.Write a Pandas program to convert all the string values to upper, lower cases 
#in a given pandas series. Also find the length of the string values.
a=pd.Series(['Sravani',"KALLURI","vinDHya",])
print("Lower case :\n",a.str.lower())
print("\nUpper case :\n",a.str.upper())
print("\nLength :\n",a.str.len())

Lower case :
 0    sravani
1    kalluri
2    vindhya
dtype: object

Upper case :
 0    SRAVANI
1    KALLURI
2    VINDHYA
dtype: object

Length :
 0    7
1    7
2    7
dtype: int64

In [24]:
#5.Write a Pandas program to remove whitespaces, left sided whitespaces and 
#right sided whitespaces of the string values of a given pandas series.
a=pd.Series(["abc"," xyz"," abc xyz "])
a.str.strip()

0        abc
1        xyz
2    abc xyz
dtype: object

In [71]:
#Write a Pandas program to create and display a DataFrame consist of student 
#name, father name , mobile number as columns and register number as index.
'''d={"stu_name ":["Vijaya","Praveena","Sravani","Madhavi","Chandrika","Srilekha"],
  "father ":["Ramu","Raju","Krishna","Srinivas","Raghava","Nageswararao"],
  "Phone_no ":[99999,88888,77777,66666,55555,44444]}
i=["Y20CS009","Y20CS019","Y20CS074","Y20CS134","Y20CS178","Y20CS193"]
a=pd.DataFrame(d,index=i)
a'''
d={"stu_name":["Vijaya","Praveena","Sravani","Madhavi","Chandrika","Srilekha"],
  "father":["Ramu","Raju","Krishna","Srinivas","Raghava","Nageswararao"],
  "Phone_no":[99999,88888,77777,66666,55555,44444],
  "Red_no":["Y20CS009","Y20CS019","Y20CS074","Y20CS134","Y20CS178","Y20CS193"],}
a=pd.DataFrame(d)
a=a.set_index('Red_no')
print(a)

           stu_name        father  Phone_no
Red_no
Y20CS009     Vijaya          Ramu     99999
Y20CS019   Praveena          Raju     88888
Y20CS074    Sravani       Krishna     77777
Y20CS134    Madhavi      Srinivas     66666
Y20CS178  Chandrika       Raghava     55555
Y20CS193   Srilekha  Nageswararao     44444

In [72]:
#7.Write a Pandas program to get list from DataFrame column headers.
print(a.columns.values)

['stu_name' 'father' 'Phone_no']

In [73]:
#8.Write a Pandas program to change the name of the student
a['stu_name']=a['stu_name'].replace("Sravani","Vindhya")
print(a)

           stu_name        father  Phone_no
Red_no
Y20CS009     Vijaya          Ramu     99999
Y20CS019   Praveena          Raju     88888
Y20CS074    Vindhya       Krishna     77777
Y20CS134    Madhavi      Srinivas     66666
Y20CS178  Chandrika       Raghava     55555
Y20CS193   Srilekha  Nageswararao     44444

In [75]:
#9.Write a Pandas program to insert a new column “grade” in existing DataFrame.
a['Grade']=['A','A+','A+','B','A','A']
a

           stu_name        father  Phone_no Grade
Red_no
Y20CS009     Vijaya          Ramu     99999     A
Y20CS019   Praveena          Raju     88888    A+
Y20CS074    Vindhya       Krishna     77777    A+
Y20CS134    Madhavi      Srinivas     66666     B
Y20CS178  Chandrika       Raghava     55555     A
Y20CS193   Srilekha  Nageswararao     44444     A

In [77]:
#10.Write a pandas program to create and display a dataframe from a specified dictionary data which has the index labels.
d={"stu_name":["Vijaya","Praveena","Sravani","Madhavi","Chandrika","Srilekha"],
  "Red_no":["Y20CS009","Y20CS019","Y20CS074","Y20CS134","Y20CS178","Y20CS193"],}
a=pd.DataFrame(d,index=[1,2,3,4,5,6])
a

    stu_name    Red_no
1     Vijaya  Y20CS009
2   Praveena  Y20CS019
3    Sravani  Y20CS074
4    Madhavi  Y20CS134
5  Chandrika  Y20CS178
6   Srilekha  Y20CS193